geo_url = "https://geocoding-api.open-meteo.com/v1/search"
weather_url = "https://api.open-meteo.com/v1/forecast"

weather_codes_ru = {
    0: "Ясное небо",
    1: "Преимущественно ясно",
    2: "Переменная облачность",
    3: "Пасмурно",
    45: "Туман",
    48: "Туман с изморозью",
    51: "Легкая морось",
    53: "Умеренная морось",
    55: "Сильная морось",
    56: "Легкая ледяная морось",
    57: "Сильная ледяная морось",
    61: "Небольшой дождь",
    63: "Умеренный дождь",
    65: "Сильный дождь",
    66: "Легкий ледяной дождь",
    67: "Сильный ледяной дождь",
    71: "Небольшой снегопад",
    73: "Умеренный снегопад",
    75: "Сильный снегопад",
    77: "Снежная крупа",
    80: "Небольшие ливневые дожди",
    81: "Умеренные ливневые дожди",
    82: "Сильные ливневые дожди",
    85: "Небольшие ливневые снегопады",
    86: "Сильные ливневые снегопады",
    95: "Гроза (слабая или умеренная)",
    96: "Гроза со слабым градом",
    99: "Гроза с сильным градом"
}